[Language]
DisplayName=Русский
[MainDlg]
MainDlg=PowerBox Toolbox
TitleFormat=%s (%s для показа/скрытия)
Tab1=Процессы
Tab2=Автозагрузка
Tab3=Буфер обмена
Tab4=Окна
Tab5=Файлы
Tab6=Git
QuickTab1=ИИ-помощник
QuickTabLaunch=Быстрый запуск
QuickTab2=Система
QuickTab3=Инструменты
[ProcessTab]
ColName=Имя процесса
ColCPU=ЦП%
ColPath=Путь
ColMemory=Память (КБ)
ColPID=PID
[StartupTab]
ColName=Имя автозагрузки
ColCmd=Команда (Путь)
ColLocation=Расположение
[ClipboardTab]
ColText=Текст (двойной щелчок для копирования)
[WindowTab]
ColField=Поле
ColValue=Значение
ColType=Тип
ColTitle=Заголовок окна
ColIndex=Индекс
TopmostLabel=Поверх всех[%zu]
TransparencyLabel=Прозрачность: %d%%
TranparencyLabel=Прозрачность: 100%
LocateBtn=Найти окно
ForceKillBtn=Принудительно завершить
ScreenshotBtn=Скриншот в буфер
Handle=Дескриптор
Path=Путь
PID=PID
ProcName=Имя процесса
RClickCancel=Отмена
RClickCloseWindow=Закрыть окно
RClickTopmost=Переключить поверх всех
Title=Заголовок

[Msg]
CreateDlgFailed=Не удалось создать диалог
GitMenuExec=Выполнить
GitMenuCopy=Копировать команду
GitMenuEdit=Изменить команду
GitMenuDelete=Удалить
DropGitFolderHint=Перетащите папку или каталог сюда
DropFileHint=Перетащите файлы сюда
GitRepoDetached=HEAD отсоединён
GitRepoBranch=Ветка: %s
GitNotRepo=Не является репозиторием Git
GitNoWorkDir=Сначала укажите рабочую директорию.
GitCurrentBranch=Текущая ветка:
GitConfirmExec=Вы уверены, что хотите выполнить следующую команду?\n\n%s\n\n%s
GitConfirmTitle=Подтверждение выполнения команды Git
GitResultWindowFailed=Не удалось создать окно результата.
GitCmdWindowFailed=Не удалось создать окно команд Git.
GitEditPrompt=Изменить команду:
EnterCommand=Введите команду.
ExecCmdFailed=Ошибка выполнения команды: %s
PreventLockFailed=Не удалось предотвратить блокировку экрана.
PowerShellConfirm=Выберите способ запуска PowerShell:\nДа (Y) — запуск от имени администратора\nНет (N) — обычный режим
PowerShellTitle=Запуск PowerShell
PowerShellNonAdminFailed=Не удалось запустить PowerShell: %s
PowerShellAdminFailed=Не удалось запустить PowerShell от имени администратора: %s
WslLaunchFailed=Не удалось запустить WSL.
OpenLinkFailed=Не удалось открыть ссылку.
GitBashNotFound=Git Bash не найден. Проверьте настройки.
PleaseSelectProcess=Сначала выберите процесс.
NoProcessSelected=Процесс не выбран.
ConfigApiKeyFirst=Сначала настройте ключ API ИИ в разделе Настройки.
AnalyzingProcesses=Анализ %d процессов, подождите...
AiAnalysisFailed=Ошибка анализа ИИ:
ConfirmEndProcess=Вы уверены, что хотите завершить процесс\n%s (PID: %s)?
ConfirmEndProcessTitle=Подтверждение завершения процесса
ConfirmEndSameName=Вы уверены, что хотите завершить все процессы «%s»?\nНайдено экземпляров: %d.
ProcessEnded=Процесс успешно завершён.
ProcessEndFail=Не удалось завершить процесс: %s
ProcessEndFailSimple=Не удалось завершить процесс.
CannotOpenProcess=Не удалось открыть процесс для завершения. Ошибка: %s
CannotOpenProcessSimple=Не удалось открыть процесс. Недостаточно прав.
BatchEndResult=Завершено процессов: %d, не удалось: %d.
BatchEndResultTitle=Результат массового завершения
Success=Успешно
Error=Ошибка
Warning=Предупреждение
ConfirmDelete=Подтверждение удаления
AccessDenied=Доступ запрещён
Completed=Завершено
Info=Информация
ConfirmForceKill=Вы уверены, что хотите принудительно завершить PID=%u?\nНесохранённые данные могут быть потеряны.
ProcessForceKilled=Процесс принудительно завершён.
ProcessForceKillFailed=Не удалось принудительно завершить процесс.
InvalidWindow=Сначала найдите окно.
CannotGetPID=Не удалось получить идентификатор процесса.
NoWindowSelected=Не выбрано ни одного окна.
TopmostFail=Не удалось установить поверх всех. Недостаточно прав или окно не позволяет.
FileNotFound=Сначала перетащите файл!
CopySuccess=Копия создана!\nСохранено в: %s
CopyFail=Не удалось создать копию. Код ошибки: %u
RenameSuccess=Переименование успешно!
RenameFail=Не удалось переименовать. Код ошибки: %u
DeleteConfirm=Вы уверены, что хотите переместить следующий файл в корзину?\n%s
DeleteSuccess=Файл перемещён в корзину.
DeleteFail=Не удалось удалить файл. Код ошибки: %d
StartupAdded=Запись автозагрузки добавлена.
StartupAddFail=Не удалось добавить запись автозагрузки. Проверьте права.
StartupRemoved=Запись автозагрузки удалена.
StartupRemoveFail=Не удалось удалить запись автозагрузки. Проверьте права.
ConfirmRemoveStartup=Вы уверены, что хотите удалить запись автозагрузки\n%s?
NeedAdminRestart=Не удалось перезапустить с правами администратора. Запустите программу вручную от имени администратора.
OleInitFail=Не удалось инициализировать OLE. Функция перетаскивания недоступна.
EnterLocateModeFail=Не удалось войти в режим поиска окна.
ConfigDefaultName=Сначала настройте имя файла по умолчанию в Файл > Настройки > Именование файлов.
CannotGenUniqueName=Не удалось создать уникальное имя файла. Проверьте права на целевую папку или укажите имя вручную.
ConfirmBatchEnd=Подтверждение массового завершения
ConfirmBatchEndMsg=Вы уверены, что хотите завершить %d выбранных процессов?\nЭто может привести к некорректному завершению связанных программ.
ConfirmForceKillTitle=Подтверждение принудительного завершения
UnknownError=Неизвестная ошибка
AiScanNoContent=Сканирование ИИ завершено, но не получено содержимого
AiParseError=Ошибка формата ответа ИИ, действительный JSON не найден
AiParseFailMsg=Ошибка разбора ответа ИИ: %hs
ScanCompleteMsg=Сканирование завершено, найдено %d подозрительных/ненужных процессов
CannotGetPath=Не удалось получить путь к процессу.
FileNotFoundMsg=Файл не найден.
NoProcessToEnd=Нет процессов для завершения.
EndAllPreviewMore=  ...и ещё %d процессов\n
EndAllStep1=[Предупреждение] Вы собираетесь завершить все %d процессов из списка!\n\nЭто действие необратимо и может привести к:\n  · Некорректному завершению программ или сбоям системы\n  · Потере несохранённых данных\n  · При неточном анализе ИИ могут быть затронуты критические компоненты системы\n\nПодтвердите, что следующие процессы можно завершить:\n%s\n\nВы осознаёте последствия и хотите продолжить?
EndAllStep1Title=Предупреждение: завершить все (шаг 1)
EndAllStep2=Окончательное подтверждение: вы уверены, что хотите принудительно завершить все %d процессов из списка?\nПожалуйста, убедитесь ещё раз: ни один из этих процессов не является критическим для нормальной работы системы.
EndAllStep2Title=Окончательное подтверждение: завершить все
EndAllResult=Операция завершения всех процессов выполнена:\nУспешно: %d, Не удалось: %d
EndAllResultTitle=Результат завершения всех
EndAllDone=Операция завершения всех процессов выполнена
Scanning=Сканирование процессов...
GitNoPathError=Сначала укажите рабочую директорию Git.
BashNotFound=Ошибка: bash.exe не найден.\nНастройте путь к Git Bash в настройках.
PipeCreateError=Ошибка: не удалось создать канал.
ProcessStartError=Ошибка: не удалось запустить процесс (код ошибки: %lu)\nКомандная строка: %s
ExitCode=Код возврата
NoOutput=(нет вывода)
AiGenFail=Не удалось сгенерировать команду ИИ, проверьте API-ключ и подключение к сети.
PleaseEnterQuestion=Введите описание вопроса.
PleaseConfigApiKey=Сначала настройте API-ключ в настройках.
InputFormatHint=Формат: описание|команда
NoWorkDirSet=Сначала укажите рабочую директорию Git.
PleaseSelectProcess=Выберите как минимум один процесс.
ConfirmEndProcesses=Вы уверены, что хотите завершить следующие %zu процессов?\n\n
EndMoreHint=  ... %zu ещё\n
UnsavedDataWarning=\n\nНесохранённые данные могут быть потеряны!
Confirm=Подтвердить
NoLockFound=Блокирующих процессов не найдено.
ConfirmEndAllLocks=Вы уверены, что хотите завершить все %zu блокирующих процессов?\n\nНесохранённые данные могут быть потеряны!
None=Нет
ConfirmEndAllTitle=Подтверждение завершить все
MsgConfirmEndProcessTitle=Подтверждение завершения процесса
MsgEndProcess=Завершить процесс
MsgEndAllSameName=Завершить все с одинаковым именем
MsgLocate=Найти
MsgAiAnalyze=Анализ ИИ
MsgBatchEndComplete=Массовое завершение завершено
MsgFileNotFound=Файл не найден
MsgNoProcessSelected=Процесс не выбран
MsgConfigApiKeyFirst=Сначала настройте ключ API ИИ в разделе Настройки.
MsgAiScanFail=Сканирование ИИ
MsgAiScanFailed=Не удалось выполнить сканирование ИИ, проверьте подключение к сети и API-ключ.
MsgScanning=Сканирование
MsgForceKill=Принудительно завершить
MsgConfirmForceKill=Подтверждение принудительного завершения
MsgTopmostFail=Ошибка установки поверх всех
MsgLocateWindowFirst=Сначала найдите окно.
MsgCannotGetPID=Не удалось получить PID
MsgCloseWindow=Закрыть окно
MsgConfirmClose=Подтверждение закрытия
MsgScreenshotSaved=Скриншот сохранён
MsgCopySuccess=Копирование успешно
MsgRenameSuccess=Переименование успешно
MsgMoveSuccess=Перемещение успешно
MsgDeleteSuccess=Удаление успешно
MsgStartup=Автозагрузка
MsgConfirmDelete=Подтверждение удаления
MsgCompleted=Завершено
MsgError=Ошибка
MsgCannotOpenProcess=Не удалось открыть процесс
MsgAccessDenied=Доступ запрещён
MsgForceKillFail=Не удалось принудительно завершить
MsgInvalidWindow=Недопустимое окно
MsgWindowSizeInvalid=Недопустимый размер окна
MsgClipboardFail=Ошибка буфера обмена
MsgCannotGetPath=Не удалось получить путь
MsgCannotBrowse=Не удалось открыть обзор
MsgWarning=Предупреждение
MsgConfirm=Подтверждение
MsgNotAvailable=Н/Д
MsgSigned=Действителен
MsgUnsigned=Недействителен/Без подписи
MsgNoCompany=Нет
MsgNoOrigName=Нет
MsgProcessListEmpty=Список процессов пуст
MsgPleaseRefresh=Сначала обновите список процессов.
MsgEndProcessTitle=Завершение процесса
MsgPleaseEnterCommand=Введите команду для выполнения.
MsgRunCmdFailed=Не удалось выполнить команду
MsgPreventLockFail=Не удалось установить состояние предотвращения блокировки системы.
MsgPowerShellFail=Не удалось запустить PowerShell
MsgPowerShellAdminFail=Не удалось запустить PowerShell с правами администратора
MsgWSLFail=Не удалось запустить WSL, запустите wsl.exe вручную
MsgLinkFail=Не удалось открыть ссылку
MsgGitBashNotFound=git-bash.exe не найден. Настройте путь к Git Bash в настройках.
MsgCmdWindowFail=Не удалось создать окно команд Git.
MsgSetWorkDirFirst=Сначала укажите рабочую директорию.
MsgConfirmExec=Подтверждение выполнения
MsgExecCmd=Выполнить команду
MsgResultWindowFail=Не удалось создать окно результата.
MsgEndProcessAll=Завершить все с одинаковым именем
MsgBatchEndConfirm=Подтверждение массового завершения
MsgTaskManagerFail=Не удалось запустить Диспетчер задач
MsgProcessPathEmpty=Путь к процессу пуст.
MsgFileNotFoundBrowse=Файл не найден, возможно, недоступен или процесс завершён.
MsgConfirmDeleteFile=Подтверждение удаления файла
MsgFileNameEmpty=Имя файла не может быть пустым.
MsgInvalidFileName=Имя файла или расширение содержат недопустимые символы.
MsgTargetFileExists=Целевой файл уже существует. Выберите другое имя.
MsgTargetPathInvalid=Целевой путь недопустим. Введите или выберите существующий каталог.
MsgTargetNotDir=Целевой путь не является каталогом. Выберите папку.
MsgCannotGenUniqueName=Не удалось создать уникальное имя файла. Проверьте каталог или выберите имя вручную.
MsgTargetExists=В целевом каталоге уже есть файл с таким именем. Удалите его или измените путь.
MsgCannotGetAppPath=Не удалось получить путь к приложению.
MsgRegAccessFail=Не удалось открыть раздел реестра. Проверьте права доступа.
MsgStartupRemoved=Запись автозагрузки удалена.
MsgStartupRemoveFail=Не удалось удалить запись автозагрузки. Проверьте права.
MsgStartupAdded=Запись автозагрузки добавлена.
MsgStartupAddFail=Не удалось добавить запись автозагрузки. Проверьте права.
MsgConfirmRemoveStartup=Вы уверены, что хотите удалить запись автозагрузки?
MsgAiNoApiKey=Анализ ИИ
MsgSelectProcessFirst=Сначала выберите процесс для анализа.
MsgConfigApiKey=Сначала настройте ключ API ИИ в разделе Настройки.
MsgRefreshProcessList=Сначала обновите список процессов.
MsgCreateProcessFail=Не удалось создать процесс
MsgAdminRestartFail=Не удалось перезапустить с правами администратора. Запустите программу вручную от имени администратора.
MsgOleInitFail=Не удалось инициализировать OLE. Функция перетаскивания недоступна.
MsgEnterLocateModeFail=Не удалось войти в режим поиска окна.
MsgConfigDefaultName=Сначала настройте имя файла по умолчанию в Файл > Настройки > Именование файлов.
MsgConfirmDeleteStartup=Вы уверены, что хотите удалить запись автозагрузки
MsgYesNo=Да/Нет
HighRiskWarningTitle=Предупреждение о высоком риске
HighRiskPrompt=Эта операция сопряжена с высоким риском. Введите «Подтвердить выполнение», чтобы продолжить:
AiScanFailedStatus=Не удалось выполнить сканирование ИИ: %s
AiScanFailedMsg=Не удалось выполнить сканирование ИИ, проверьте подключение к сети и API-ключ.\n%s
NeedAdminRestart=Не удалось перезапустить с правами администратора. Запустите программу вручную от имени администратора.
InvalidJsonCmd=Не удалось разобрать команду, неверный формат JSON.
AiCmdConfirmFmt=ИИ запрашивает выполнение следующей команды:\n\nКоманда: %s\n\nЦель: %s\n\nУровень риска: %s
HighRiskConfirmText=Подтвердить выполнение
InputMismatchCancel=Несовпадение ввода, операция отменена.
Cancelled=Отменено
ExecConfirm=Подтвердить выполнение
CmdCancelledFmt=[Результат выполнения команды]\nКоманда: %s\nСтатус: Отменено (пользователь не подтвердил)\n
ExecFailedErrCode=Ошибка выполнения, код ошибки: %d
CannotCreatePipe=Ошибка: не удалось создать выходной канал
OutputLabel=Вывод:\n
ExitCodeFmt=Код возврата: %d\n
PromptRestartAdminMsg=Для этой операции требуются права администратора. Перезапустить программу с правами администратора?
NeedPermission=Требуются права
ShellWindowFailed=Не удалось получить окно оболочки.
ShellPidFailed=Не удалось получить идентификатор процесса оболочки.
Valid=Действителен
ValidPrefix=Действителен (
InvalidNoSig=Недействителен или без подписи
ProcInfoFmt=[Имя процесса] %s (PID: %s)\n[Путь] %s\n[Подпись] %s\n[Компания] %s\n[Исходное имя] %s
AddStartupFail=Не удалось добавить элемент автозагрузки! Проверьте права.
AiAnalyze=Анализ ИИ
AiScan=Сканирование ИИ
AutoStartDisabled=Автозапуск отключён
AutoStartEnabled=Автозапуск включён
CannotGetExePath=Не удалось получить путь к исполняемому файлу
CannotOpenProcErr=Не удалось открыть процесс, ошибка: %s
CannotOpenRegKey=Не удалось открыть раздел реестра
ClipboardFail=Ошибка операции с буфером обмена
ConfirmCloseTitle=Подтверждение закрытия
ConfirmCloseWindow=Вы уверены, что хотите закрыть выбранное окно?
CopyFileSuccess=Файл скопирован успешно!
CopySuffix=Копия
DeleteStartupFail=Не удалось удалить элемент автозагрузки! Проверьте права.
DestNotDir=Целевой путь не является каталогом
FileAlreadyExists=Файл уже существует
FileNameEmpty=Имя файла пусто
FileNotFoundForProcess=Файл не найден для процесса
InvalidDestPath=Недопустимый целевой путь
InvalidFileNameChars=Имя файла содержит недопустимые символы
InvalidWindowSize=Недопустимый размер окна
MoveFail=Ошибка перемещения, код ошибки: %u
MoveSuccess=Перемещено успешно!
NoPathForProcess=Путь к процессу пуст
NoSignature=Нет цифровой подписи
ProcessForceKillFail=Не удалось принудительно завершить процесс.
RefreshProcessListFirst=Сначала обновите список процессов.
ScreenshotSavedTo=Скриншот сохранён в: %s
TargetFileExists=Целевой файл уже существует
TaskMgrFail=Не удалось запустить Диспетчер задач
[ProcessAiResult]
BtnCopy=Копировать результат
BtnSave=Сохранить результат
BtnClose=Закрыть
DefaultFileName=Результат AI-анализа.txt
FileFilter=Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*||


[ProcessMenu]
EndProcess=Завершить процесс
EndSameName=Завершить все с одинаковым именем
Locate=Найти
AiAnalyze=Анализ ИИ
[StartupMenu]
Add=Добавить запись автозагрузки
AddMachine=Добавить общий автозапуск
Remove=Удалить запись автозагрузки
CopyPath=Копировать путь
[TrayMenu]
ShowWindow=Показать окно
Exit=Выход
[FileTab]
DropHint=Перетащите файлы сюда
[GitTab]
OpenGitHub=Открыть GitHub
ClearPath=Очистить путь
GitBash=Git Bash
CmdWindow=Окно Cmd
Locate=Найти
DefaultDir=(По умолчанию)
ColDesc=Описание
ColCmd=Команда
[GitCommands]
Cmd1Desc=Инициализировать локальный репозиторий
Cmd2Desc=Добавить все файлы в индекс
Cmd3Desc=Зафиксировать в локальном репозитории
Cmd4Desc=Добавить удалённый репозиторий (origin)
Cmd5Desc=Переименовать ветку в main
Cmd6Desc=Отправить и настроить upstream
Cmd7Desc=Получить изменения из удалённого репозитория
Cmd8Desc=Клонировать удалённый репозиторий
Cmd9Desc=Проверить статус
Cmd10Desc=Добавить все изменения в индекс
Cmd11Desc=Зафиксировать в локальном репозитории
Cmd12Desc=Отправить в удалённый репозиторий
Cmd13Desc=Показать все ветки (включая удалённые)
Cmd14Desc=Создать и переключиться на ветку
Cmd15Desc=Переключиться на ветку
Cmd16Desc=Слить ветку с текущей
Cmd17Desc=Удалить слитую ветку
Cmd18Desc=Показать краткий журнал коммитов
Cmd19Desc=Восстановить изменения в рабочем дереве
Cmd20Desc=Убрать файлы из индекса
[Shutdown]
Restart1Min=Перезагрузка через 1 минуту
Shutdown3Min=Выключение через 3 минуты (по умолчанию)
CustomTime=Выключение в заданное время
[AutoClicker]
StoppedTitle=Автокликер
StoppedMsg=Автоклик остановлен
StatusStopped=Остановлен
StatusClicking=Клик (нажмите %c для остановки)
StatusWaiting=Ожидание (нажмите %c для запуска, %c для остановки)
VbsPrompt=Интервал клика (мс/клик):
VbsTitle=Автокликер
LabelInterval=Интервал (мс):
[AI]
ReadyMsg=ИИ-помощник готов<br><span style='font-size:13px;'>Спросите меня о чём угодно в этом наборе инструментов!</span>
NoApiKey=<div style='color:red;'>[Ошибка] Не настроен API-ключ для %s. Перейдите в Файл > Настройки > ИИ-помощник, чтобы настроить его.</div>
[Settings]
LanguageLabel=Язык
LanguageRestartHint=Приложение автоматически перезапустится после смены языка.
TabPath=Пути
TabTemplate=Именование
TabAutoClicker=Автокликер
TabAI=ИИ-помощник
AIVendor=Поставщик ИИ
AIKey=API-ключ
AIShow=Показать
AIHide=Скрыть
TabScreenshot=Скриншоты
TabStickyNote=Заметки
TabSites=Сайты
TabLanguage=Язык
GroupFileNaming=Именование файлов
LabelDefaultName=Имя файла по умолчанию:
GroupPathSettings=Настройки путей
LabelScreenshot=Папка сохранения скриншотов:
LabelStickyDir=Папка сохранения заметок:
BtnBrowse=Обзор
LabelClickInterval=Интервал клика (мс):
LabelStartKey=Клавиша запуска:
LabelStopKey=Клавиша остановки:
GroupAI=ИИ-помощник
LabelVendor=Поставщик:
LabelApiKey=API-ключ:
BtnShow=Показать
BtnHide=Скрыть
GroupLanguage=Язык
LabelLanguage=Язык:
BtnOK=OK
BtnCancel=Отмена
GroupAutoClicker=Автокликер
DlgTitleScreenshot=Выберите папку для сохранения скриншотов
DlgTitleSticky=Выберите папку для сохранения заметок
MsgKeySame=Клавиша запуска и остановки не могут совпадать. Перенастройте.
GroupHotkey=Горячие клавиши
LabelHotkeyShowHide=Показать/скрыть окно:
LabelHotkeyLocate=Найти окно:
BtnHotkeyCapture=Захватить
MsgHotkeyDuplicate=Дублирующаяся горячая клавиша: показать/скрыть и найти окно используют одну комбинацию. Перенастройте.
GroupGit=Git
LabelGitBash=Путь к Git Bash:
DlgTitleGitBash=Выберите путь к Git Bash
[ContextMenu]
ColLocation=Расположение
ColDisplayName=Отображаемое имя
ColType=Тип
ColVisibility=Видимость
ColKeyName=Имя ключа
ColCommand=Команда
TypeStatic=Статический
TypeShellEx=ShellEx
Visible=Видимый
Hidden=Скрытый
Extended=Расширенный
Disabled=Отключён
Enabled=Включён
RClickEnable=Включить
RClickDisable=Отключить
RClickEnableSelected=Включить выбранные
RClickDisableSelected=Отключить выбранные
RClickDelete=Удалить
RClickLocate=Найти
RClickLocateReg=Найти (в реестре)
RClickCustomParse=Пользовательский разбор имени
RClickAiAnalyze=Анализ ИИ
RClickEnableAll=Включить все
FolderMenuLabel=Контекстное меню папки: открывать с помощью этой программы
Win11ClassicLabel=Классическое меню Win11 (Shift+правый клик)
BtnRefresh=Обновить
BtnDelete=Удалить
BtnLocate=Найти
BtnRebuild=Перестроить словарь
BtnDictPath=Путь к словарю
BtnDictOpen=Открыть словарь
BtnUndo=Отменить
BtnHistory=История
BtnQuery=Запрос
ExtensionPlaceholder=Введите расширение файла (точка необязательна)
LabelLocation=Фильтр по расположению:
StatusReady=Готов
SceneAll=Все
SceneFile=Файл (*)
SceneFolder=Папка (все папки)
SceneVirtualFolder=Папка (виртуальные папки)
SceneDirBackground=Фон каталога
SceneDesktopBg=Фон рабочего стола
SceneDrive=Диск
SceneAllFiles=Все файлы
SceneThisPC=Этот компьютер
SceneRecycleBin=Корзина
SceneLibrary=Библиотека
SceneUWP=Ярлык UWP
SceneExe=exe-файл
SceneUnknown=Неизвестный файл
SceneShortcut=Ярлык
SceneJpg=.jpg / .jpeg (изображение JPEG)
ScenePng=.png (изображение PNG)
SceneGif=.gif (изображение GIF)
SceneBmp=.bmp (изображение BMP)
SceneTxt=.txt (текстовый файл)
ScenePdf=.pdf (документ PDF)
SceneDoc=.doc / .docx (документ Word)
SceneMp4=.mp4 (видеофайл)
SceneMp3=.mp3 (аудиофайл)
SceneZip=.zip / .rar (архив)
SceneExeFile=.exe (исполняемый файл)
SceneDll=.dll (библиотека)
SceneHtml=.html / .htm (веб-страница)
StatusFoundItems=Найдено элементов контекстного меню: %d
StatusDictPath=  |  Словарь: %s
StatusDictEmbeddedCache=  |  Словарь: встроенный + кэш (%s)
StatusDictEmbedded=  |  Словарь: встроенный (жёстко заданный)
StatusQueryExt=Запрос расширения %s: найдено элементов контекстного меню: %d
StatusFolderMenuAdded=Элемент контекстного меню папки добавлен
StatusFolderMenuRemoved=Элемент контекстного меню папки удалён
StatusWin11Enabled=Классическое меню Win11 включено, перезапуск проводника...
StatusWin11Disabled=Новое меню Win11 восстановлено, перезапуск проводника...
StatusToggleFormat=%s: %s
StatusActionEnabled=Включено
StatusActionDisabled=Отключено
StatusDisabledCount=%d элемент(ов) отключено
StatusEnabledCount=%d элемент(ов) включено
StatusCustomParseDeleted=Пользовательский разбор для %s удалён.
StatusCustomParseSaved=Пользовательский разбор для %s сохранён как: %s
StatusDictPathUpdated=Папка словаря обновлена: %s
StatusRebuildProgress=Перестроение словаря: %d CLSID (%d сцен), подождите...
StatusRebuildComplete=Перестроение словаря завершено: разрешено %d/%d CLSID (реестр: %d, COM: %d, запасной: %d). Кэш: %s
StatusRebuildFailed=Перестроение словаря завершено: разрешено %d/%d CLSID, но не удалось сохранить кэш.
StatusNoClsidFound=ShellEx CLSID не найдены, перестроение не требуется.
StatusBackupDirFail=Не удалось создать папку резервных копий
StatusUndoFormat=Отменено: %s
StatusHistoryRecent=... (показаны только последние 50 записей)
DictInfoCurrent=Текущий словарь: %s  |  Кэш: %s
DictInfoEmbeddedCache=Текущий словарь: встроенный + кэш  |  Кэш: %s
DictInfoEmbedded=Текущий словарь: встроенный (жёстко заданный)  |  Кэш: %s
InputExtHint=Введите расширение файла для запроса, например .mp4, .txt и т.д.
ConfirmDisable=Подтверждение отключения
ConfirmEnable=Подтверждение включения
ConfirmUndo=Подтверждение отмены
ConfirmRebuild=Подтверждение перестроения
MsgNoSelection=Сначала выберите элемент.
MsgNoHistory=Нет истории операций.
MsgNoHistoryUndo=Нет операций для отмены.
MsgItemNotFound=Не удалось найти соответствующий пункт меню, возможно, он был удалён.
MsgAllSelectedDisabled=Все выбранные элементы уже отключены.
MsgAllSelectedEnabled=Все выбранные элементы уже включены.
MsgNoClsid=Не удалось получить CLSID для этого элемента, невозможно выполнить пользовательский разбор.
MsgEnterCustomName=CLSID: %s\nТекущее имя: %s\n\nВведите пользовательское отображаемое имя (оставьте пустым, чтобы удалить пользовательский разбор):
MsgDictFolderNotFound=Папка словаря не существует.
MsgCantParseShellExPath=Не удалось разобрать путь ShellEx в реестре.
MsgCantOpenRegKey=Не удалось открыть раздел реестра: %s\nКод ошибки: %d
MsgCopyRegKeyFailed=Не удалось скопировать раздел реестра.\n\nИсточник: %s\%s\nЦель: %s\%s
MsgDeleteOldRegFailed=Не удалось удалить старый раздел реестра, выполнен откат.\nКод ошибки: %d
MsgUnrecognizedShellEx=Неизвестная папка ShellEx: %s
MsgAiNoApiKey=Сначала настройте API-ключ в разделе Файл > Настройки > ИИ-помощник.
MsgAiAnalyzeFail=Ошибка анализа ИИ: %s
MsgAiAnalyzeResult=Результат анализа ИИ
MsgConfirmDisableCount=Вы уверены, что хотите отключить %d элемент(ов) контекстного меню?\nОтключённые элементы можно снова включить через контекстное меню.
MsgConfirmEnableCount=Вы уверены, что хотите включить %d элемент(ов) контекстного меню?
MsgCriticalWarning=Предупреждение: некоторые выбранные элементы являются системно-критическими элементами контекстного меню!\n\nИх отключение может повлиять на нормальную работу проводника Windows.\nПеред изменением будет автоматически создана резервная копия реестра.\n\nВы уверены, что хотите продолжить?
MsgCriticalWarningTitle=Критическое предупреждение — подтверждение отключения
MsgUndoConfirm=Вы уверены, что хотите отменить следующую операцию?\n\nВремя: %s\nОперация: %s\nЭлемент: %s\nПодробности: %s\n\nЭто восстановит элемент в предыдущее состояние.
MsgUndoConfirmTitle=Подтверждение отмены
MsgOpenSourceParentFail=Не удалось открыть исходный раздел реестра.
MsgCreateTargetFail=Не удалось создать целевой раздел реестра.
MsgRebuildPrompt=Это сканирует все зарегистрированные CLSID ShellEx и разрешает их отображаемые имена через реестр и COM-интерфейсы.\nПроцесс может занять несколько секунд. Продолжить?
MsgHistoryTitle=История операций (сначала новые)
CustomParseTitle=Пользовательский разбор имени
RebuildTitle=Перестроение словаря
AiAnalyzeTitle=Анализ ИИ
AiPromptHeader=Анализ элемента контекстного меню Windows (реестр):
AiPromptScene=Сцена: %s
AiPromptKeyName=Имя ключа: %s
AiPromptDisplayName=Отображаемое имя: %s
AiPromptCommand=Команда: %s
AiPromptType=Тип: %s
AiPromptFooter=Угадайте, какому программному обеспечению принадлежит этот пункт контекстного меню и какую функцию он предоставляет. Ответ в пределах 30 символов.
MsgConfirmDisable=Подтверждение отключения

[EnvVar]
ColName=Имя переменной
ColValue=Значение переменной
SystemLabel=Системные переменные
UserLabel=Пользовательские переменные
BtnAdd=Добавить
BtnEdit=Изменить
BtnDelete=Удалить
BtnRefresh=Обновить
BtnExport=Экспортировать
SearchPlaceholder=Поиск переменных среды...
LabelSearch=Поиск:
RClickEdit=Изменить
RClickDelete=Удалить
RClickCopyName=Копировать имя
RClickCopyValue=Копировать значение
RClickCopy=Копировать
RClickMoveUp=Переместить вверх
RClickMoveDown=Переместить вниз
DlgAddTitle=Добавить переменную среды
DlgEditTitle=Изменить переменную среды
DlgConfirmDelete=Подтверждение удаления
DlgWriteFail=Ошибка записи
DlgDeleteFail=Ошибка удаления
DlgExportFail=Ошибка экспорта
PathListCol=Запись пути
PathEditTitle=Изменить переменную %s
PathSelectFolder=Выберите папку для добавления
PathSelectNewFolder=Выберите новый путь
StatusRefreshed=Обновлено
StatusCopiedName=Скопировано имя: %s
StatusCopiedValue=Скопировано значение: %s
StatusExported=Экспортировано в: %s
StatusAdded=Добавлена переменная %s: %s | Резервная копия: %s
StatusUpdated=Обновлена переменная %s: %s | Резервная копия: %s
StatusDeleted=Удалена переменная %s: %s | Резервная копия: %s
StatusSearch=Поиск «%s»: системных %d/%d, пользовательских %d/%d
StatusTotal=Системных: %d переменных | Пользовательских: %d переменных
ConfirmAddType=Добавить системную или пользовательскую переменную?\n\nДа = системная, Нет = пользовательская
ConfirmDeleteVar=Вы уверены, что хотите удалить %s переменную «%s»?
ErrNameEmpty=Имя переменной не может быть пустым.
ErrSelectEdit=Выберите запись для изменения.
ErrSelectDelete=Выберите запись для удаления.
ErrSelectVar=Выберите переменную для изменения.
ErrSelectVarDel=Выберите переменную для удаления.
ErrWriteFail=Не удалось записать переменную %s.\n\nДля изменения системных переменных могут потребоваться права администратора.
ErrDeleteFail=Не удалось удалить переменную %s.\n\nДля удаления системных переменных могут потребоваться права администратора.
ErrCreateFile=Не удалось создать файл.
ExportFilter=Текстовые файлы (*.txt)|*.txt|Env-файлы (*.env)|*.env|Все файлы (*.*)|*.*||
[FileLock]
ColFilePath=Путь к файлу
ColProcessName=Имя процесса
ColPID=PID
ColType=Тип процесса
ColProcessPath=Путь к процессу
BtnEnd=Завершить
BtnEndAll=Завершить все
BtnLocate=Найти
BtnRefresh=Обновить
BtnClear=Очистить
Hint=Перетащите файлы сюда, чтобы увидеть блокирующие процессы (требуются права администратора)
HintLoaded=Загружено %zu файлов, найдено блокировок: %zu
AppTypeMainWindow=Главное окно
AppTypeOtherWindow=Другое окно
AppTypeService=Служба
AppTypeExplorer=Проводник
AppTypeConsole=Консоль
AppTypeCritical=Критический процесс
AppTypeUnknown=Неизвестно
AppTypeLocked=Заблокирован
AppTypeNotLocked=Не заблокирован
AppTypeNotFound=Не найден
AppTypeScanning=Сканирование...
[BatchRename]
ColOriginal=Исходное имя
ColNew=Новое имя
ColStatus=Статус
TabFolder=Папка
TabFile=Файлы (пакет)
BtnBrowse=Обзор
BtnPreview=Предпросмотр
BtnExecute=Выполнить
BtnUndo=Отменить
BtnRefresh=Обновить
BtnAiAssistant=ИИ-помощник
BtnResetAll=Сбросить всё
PrefixLabel=Префикс
SuffixLabel=Суффикс
ReplaceFromLabel=Найти
ReplaceToLabel=Заменить на
NumberLabel=Автонумерация
RegexLabel=Регулярное выражение
IgnoreExtLabel=Игнорировать расширение
IgnoreMatchLabel=Игнорировать совпадение
TrackExtLabel=Отслеживать расширение
TrackMatchLabel=Отслеживать совпадение
DeleteMatchLabel=Удалить совпадение
NumberAfterExt=Нумерация после расширения
BtnClear=Очистить
BtnRenameDir=Переименовать папку
BtnMoveDir=Переместить папку
BtnDeleteDir=Удалить папку
BtnRename=Переименовать
BtnMove=Переместить
BtnDelete=Удалить
BtnSelectAll=Выбрать все
BtnDeselectAll=Снять выбор
BtnClearDelete=Очистить пометки удаления
BtnRegexHelp=Справка по regex
BtnClearIgnore=Сбросить все игнорирования
BtnClearTrack=Сбросить все отслеживания
CheckInvert=Инвертировать
CheckIgnoreExt=Игнорировать расширения (через точку с запятой)
CheckIgnoreMatch=Игнорировать совпадения (включая расширение)
CheckTrackExt=Отслеживать расширения (через точку с запятой)
CheckTrackMatch=Отслеживать совпадения (включая расширение)
LabelFolder=Папка:
LabelCurrentDir=Текущий каталог:
LabelSubdir=Подкаталог:
LabelStartNum=Начать с:
LabelTip=Подсказка: расширение не изменяется; для пометки удаления/игнорирования/отслеживания используйте правый клик по списку файлов
GroupIgnore=Правила игнорирования
GroupTrack=Правила отслеживания
ColSerial=№
ColFolderName=Имя папки
BrowseTitle=Выберите папку
DragFolderOnly=Перетаскивание поддерживается только для папок.
Tip=Подсказка
SelectedCount=Выбрано: %d/%d
SelectFoldersFirst=Сначала выберите папки.
EnterNewFolderName=Введите новое имя папки:
RenameFolder=Переименование папки
InvalidFolderName=Имя папки содержит недопустимые символы.
RenameFailed=Не удалось переименовать.
RenameSuccess=Переименование успешно.
Result=Результат
RenameResult=Переименовано: %d успешно, %d с ошибками.
SelectFoldersToMove=Сначала выберите папки для перемещения.
SelectTargetFolder=Выберите целевую папку
MoveResult=Перемещено: %d успешно, %d с ошибками.
SelectFoldersToDelete=Сначала выберите папки для удаления.
ConfirmDeleteFolders=Вы уверены, что хотите переместить выбранные %d папок в корзину?
ConfirmDelete=Подтверждение удаления
DeleteResult=Удалено: %d успешно, %d с ошибками.
SelectFolderFirst=Сначала выберите папку.
EnterNewDirName=Введите новое имя каталога:
RenameCurrentDir=Переименовать текущий каталог
InvalidDirName=Имя каталога содержит недопустимые символы.
ConfirmMoveDir=Вы уверены, что хотите переместить «%s» в «%s»?
ConfirmMove=Подтверждение перемещения
MoveFailed=Не удалось переместить.
MoveSuccess=Перемещение успешно.
ConfirmDeleteCurrentDir=Вы уверены, что хотите переместить текущий каталог «%s» и всё его содержимое в корзину?
MoveToRecycleFailed=Не удалось переместить в корзину.
DeleteSuccess=Удаление успешно.
AlreadyAtTop=Элементы уже вверху, нельзя переместить выше.
EnterTargetPosition=Введите целевую позицию (1 - %d):
MoveTo=Переместить в
EnterValidNumber=Введите число от 1 до %d.
AlreadyAtBottom=Элементы уже внизу, нельзя переместить ниже.
EnterTargetPositionRange=Введите целевую позицию (%d - %d):
MoveToBottom=Переместить в конец
EnterValidNumberRange=Введите число от %d до %d.
MarkedDeleted=Удалён
Ignored=Игнорируется
TrackPrefix=[Отслеживается]
AiPrefix=[ИИ]
PreviewFirst=Сначала выполните предпросмотр, чтобы подтвердить результат.
ConfirmExecute=Будет удалено %d файлов и переименовано %d файлов. Продолжить?
DuplicateNames=Существуют дублирующиеся новые имена файлов. Проверьте правила.
ConfirmRename=Вы уверены, что хотите выполнить переименование?
OperationResult=Операция завершена: удалено %d (ошибок %d), переименовано %d (ошибок %d).
AiGeneratedNames=ИИ сгенерировал новые имена для %d файлов. Выполните предпросмотр и нажмите «Выполнить».
AiAssistant=ИИ-помощник
SelectFilesFirst=Сначала выберите файлы.
Ignore=Игнорировать
Unignore=Не игнорировать
Track=Отслеживать
Untrack=Не отслеживать
MarkDelete=Пометить на удаление
UnmarkDelete=Снять пометку
ChangeExt=Изменить расширение
RestoreExt=Восстановить исходное расширение
MoveUpOne=Переместить вверх на 1
MoveUpTo=Переместить вверх в...
MoveUpMenu=Переместить вверх
MoveDownOne=Переместить вниз на 1
MoveDownTo=Переместить вниз в...
MoveDownMenu=Переместить вниз
LocateInExplorer=Найти в проводнике
AiAnalyze=Анализ ИИ имён файлов
CancelAiMark=Отменить пометку ИИ
ResetAllConfirm=Вы уверены, что хотите сбросить все изменения?\n\nБудут сброшены префикс, суффикс, замена, нумерация, пометки удаления и имена, сгенерированные ИИ.
EnterNewExt=Введите новое расширение (без точки):
ChangeExtTitle=Изменение расширения
InvalidExt=Расширение содержит недопустимые символы.
LoadFolderFirst=Сначала выберите папку для загрузки списка файлов.
NoFilesToRename=Нет файлов для переименования (все файлы игнорируются или помечены на удаление).
SelectAll=Выбрать все
DeselectAll=Снять выделение со всех
AiDlgTitle=ИИ-помощник пакетного переименования
ColCurrentName=Текущее имя файла
ColAiSuggestion=Предложенное ИИ новое имя
AiDlgStatus=Загружено %d файлов, опишите требования к переименованию ниже.
AiDlgEnterDesc=Введите описание требований к переименованию.
AiDlgWaiting=Ожидание ответа ИИ...
AiDlgEmptyResponse=Ответ ИИ пуст.
AiDlgGenerated=ИИ сгенерировал %d предложений по переименованию. Нажмите «Применить», если устраивает.
AiDlgNoJson=В ответе ИИ не найдены действительные данные JSON.
AiDlgParseError=ИИ вернул неразбираемое содержимое. Повторите попытку или скорректируйте описание.
AiDlgParseErrorTitle=Ошибка разбора
AiDlgInvalidJson=ИИ вернул неверный формат JSON (отсутствует массив mappings).
AiDlgWarning=Примечание:
AiDlgSkipped=- %d записей пропущено (файл не найден или имя не изменилось)
AiDlgIllegal=- %d имён файлов содержали недопустимые символы, автоматически исправлены
AiDlgDupFixed=- %d конфликтов имён, автоматически добавлен суффикс
AiDlgProcessNote=Примечания по обработке
AiDlgJsonParseFail=Ошибка разбора JSON: %hs
AiDlgUnchanged=(без изменений)
AiDlgSendFirst=Сначала отправьте запрос ИИ и дождитесь результата.
AiDlgConflict=Имя файла «%s» конфликтует с существующим файлом, который не был переименован.\nСкорректируйте описание и повторите попытку.
AiDlgConflictTitle=Конфликт имён
AiDlgDuplicate=ИИ сгенерировал дублирующееся имя файла «%s».\nСкорректируйте описание и повторите попытку.
AiDlgNoValidMapping=ИИ не сгенерировал допустимые сопоставления переименования.\nПропущено %d недействительных/дублирующихся записей.
AiDlgCleanedIllegal=\nИсправлено %d имён файлов с недопустимыми символами.
AiDlgDesc=Опишите требования к переименованию (поддерживается естественный язык):
AiDlgPreview=Предпросмотр новых имён файлов, предложенных ИИ:
BtnAiSend=Отправить ИИ
BtnApply=Применить
BtnCancel=Отмена
UndoConfirm=Вы уверены, что хотите отменить последнюю операцию переименования?
UndoResult=Отмена завершена: %d успешно, %d не удалось.
UndoTitle=Отмена

[ProcessScan]
ColProcessName=Имя процесса
ColPID=PID
ColSecurityLevel=Уровень безопасности
ColDescription=Описание анализа
BtnEnd=Завершить
BtnLocate=Найти
BtnEndAll=Завершить все
BtnStartScan=Начать сканирование
LevelLabel=Уровень проверки
LevelConservative=Консервативный
LevelStandard=Стандартный
LevelAggressive=Агрессивный
RClickEnd=Завершить процесс
RClickLocate=Найти
RClickCopyPath=Копировать путь
StatusReadyFormat=Готов — выберите уровень проверки и нажмите «%s»
ScanCompleteMsg=Сканирование завершено. Проверьте результаты.

[QRCode]
InputPlaceholder=Введите текст или ссылку...
BtnGenerate=Сгенерировать QR-код
BtnCopy=Копировать в буфер
BtnSave=Сохранить
LabelInput=Введите текст (URL/текст):
EnterText=Введите текст для QR-кода.
QrCopied=QR-код скопирован в буфер обмена.
QrSaved=QR-код сохранён.
SaveTitle=Сохранить QR-код
PngFilter=Изображение PNG (*.png)|*.png|Изображение BMP (*.bmp)|*.bmp||
[OCR]
BtnCapture=Начать захват
BtnCopy=Копировать результат
BtnTranslate=Перевести >>
LangChinese=Китайский
LangEnglish=Английский
LangJapanese=Японский
LangKorean=Корейский
LabelResult=Результат распознавания:
LabelTranslated=Перевод:
StatusHint=Перетащите, чтобы выделить область экрана, нажмите ESC для отмены
OcrBusy=Выполняется OCR или перевод, подождите...
PleaseCapture=Сначала захватите текст.
Recognizing=Распознавание, подождите...
Translating=Перевод, подождите...
NoContent=Нет содержимого для копирования.
TranslateNoResponse=Ошибка перевода: ответ не получен.
TranslateEmptyResponse=Ошибка перевода: пустой ответ.
TranslateErrInitNetwork=Ошибка перевода: не удалось инициализировать сеть.
TranslateErrConnectServer=Ошибка перевода: не удалось подключиться к серверу.
TranslateErrCreateRequest=Ошибка перевода: не удалось создать запрос.
TranslateErrTimeout=Ошибка перевода: тайм-аут запроса или сетевая ошибка.
TranslateErrPrefix=Ошибка перевода:
TranslateErrParseResponse=Ошибка перевода: не удалось разобрать ответ.
TranslateErrResponseFormat=Ошибка перевода: неверный формат ответа.
OcrTranslateFail=Ошибка перевода: %s
Tip=Подсказка
TranslateFailPrefix=Ошибка перевода:
TranslateParseFail=Не удалось разобрать результат перевода
CheckUseAiTranslate=Использовать AI перевод
AiTranslateNoApiKey=AI перевод: API-ключ не настроен. Пожалуйста, настройте в настройках.
LangPair0=Китайский → Английский
LangPair1=Китайский → Японский
LangPair2=Китайский → Корейский
LangPair3=Английский → Китайский
LangPair4=Японский → Китайский
LangPair5=Корейский → Китайский
TranslateQueryLimitExceeded=Текст слишком длинный для MyMemory API. Попробуйте отметить «Использовать AI перевод» и повторите.

[Markdown]
BtnOpen=Открыть
ExecuteBtn=Выполнить
StatusReady=Готов
PurposeLabel=Цель:
RiskLevelLabel=Уровень риска:
TerminalLabel=Терминал: 
TerminalAuto=Авто
CopyCode=Копировать
CodeCopied=Скопировано
RiskLow=Низкий
RiskMedium=Средний
RiskHigh=Высокий
OpenFileTitle=Открыть Markdown-файл
MdFilter=Markdown-файлы (*.md)|*.md|Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*||
FailedToOpen=Не удалось открыть файл.
FileTooLarge=Файл слишком велик (максимум 10 МБ).
MarkdownTitle=Предпросмотр Markdown — %s
[Encoding]
FailedToOpen=Не удалось открыть файл.
FileTooLarge=Файл слишком велик (максимум 10 МБ).
BtnOpen=Открыть
BtnSaveAs=Сохранить как
BtnOverwrite=Перезаписать
BtnConvert=Преобразовать
TextFilter=Текстовые файлы (*.txt;*.md;*.csv;*.log)|*.txt;*.md;*.csv;*.log|Все файлы (*.*)|*.*||
FailedToSave=Не удалось сохранить файл.
NoFileLoaded=Файл не загружен.
FileSaved=Файл успешно сохранён.
NoOriginalFile=Нет исходного файла для перезаписи.
ConfirmOverwrite=Это переместит исходный файл в корзину и сохранит с кодировкой %s.\n\nФайл: %s\n\nПродолжить?
ConfirmOverwriteTitle=Подтверждение перезаписи
FailedToMoveToRecycle=Не удалось переместить исходный файл в корзину.
FileOverwritten=Файл успешно перезаписан.
LabelSrcEnc=Исходная кодировка
LabelDstEnc=Целевая кодировка
[GitCmdDlg]
LabelWorkDir=Рабочая директория:
LabelAiAsk=Спросить ИИ:
BtnAiAsk=Спросить
LabelCmdList=Список команд (правый клик для выполнения/копирования/изменения/удаления):
StatusReady=Статус: Готов
LabelCmdInput=Ввод команды:
BtnCmdExecute=Выполнить
BtnCmdInputClear=Очистить
StatusAiGenerating=Статус: ИИ генерирует...
StatusAiGenResult=Статус: ИИ сгенерировал %d команд, правый клик для выполнения
ColDesc=Описание
ColCmd=Команда
BtnAddCmd=Добавить команду
BtnClearCmds=Очистить
BtnCopyOutput=Копировать вывод
BtnClose=Закрыть
LabelTruncate=Обрезка меток:
BtnCount=Количество: %d/%d
ConfirmDeleteMultiple=Вы уверены, что хотите удалить %d выбранных элементов?
RClickDeleteSelected=Удалить выбранные (%d)
RClickUpSelected=Переместить выбранные вверх (%d)
RClickDownSelected=Переместить выбранные вниз (%d)
MaxItemsReached=Достигнут максимум (%d), больше добавить нельзя.
OutputLabel=Вывод:
RClickExecute=Выполнить
RClickCopy=Копировать команду
RClickEdit=Изменить команду
RClickDelete=Удалить команду
RClickExecuteSelected=Выполнить выбранные
RClickDeleteSelected=Удалить выбранные
[GitExec]
ConfirmTitle=Подтверждение выполнения
ConfirmMsg=Вы уверены, что хотите выполнить следующую команду?\n\nКоманда: %s\nРабочая директория: %s
ConfirmMsgBatch=Будет выполнено %u команд последовательно, рабочая директория: %s\n\nПодтвердить выполнение?
Running=Статус: Выполняется...
Done=Статус: Завершено
Failed=Статус: Ошибка выполнения
Cancelled=Статус: Отменено
[ConvHistory]
UnnamedTitle=Безымянный разговор
BtnClose=Закрыть
LabelTruncate=Обрезка меток:
BtnCount=Количество: %d/%d
ConfirmDeleteMultiple=Вы уверены, что хотите удалить %d выбранных элементов?
RClickDeleteSelected=Удалить выбранные (%d)
RClickUpSelected=Переместить выбранные вверх (%d)
RClickDownSelected=Переместить выбранные вниз (%d)
MaxItemsReached=Достигнут максимум (%d), больше добавить нельзя.
ColTitle=Заголовок
ColMessageCount=Сообщений
ColUpdated=Обновлено
BtnLoad=Загрузить
BtnRename=Переименовать
BtnDelete=Удалить
BtnPath=Место сохранения
RClickLoad=Загрузить
RClickDelete=Удалить
RClickRename=Переименовать
SaveLocation=Место сохранения:
SelectConvFirst=Сначала выберите разговор.
ConfirmDeleteConv=Вы уверены, что хотите удалить разговор «%s»?
ConfirmDeleteTitle=Подтверждение удаления
RenameTitle=Переименование разговора
EnterNewTitle=Введите новый заголовок разговора:
DeleteMultiple=Вы уверены, что хотите удалить выбранные %d разговоров?
LoadSingleOnly=Загрузка поддерживает только одиночный выбор.
RenameSingleOnly=Переименование поддерживает только одиночный выбор.
[StickyNote]
BtnBrowse=Обзор
RClickExit=Выход из заметок(&X)
SelectSaveDir=Выберите папку для сохранения заметок
[QuickBtn]
NextTrack=Следующий трек
[MainCtrl]
BtnRegex=Регулярное выражение
BtnAiScan=Сканирование ИИ
BtnRegexHelp=Справка
BtnNextTrack=Следующий трек
LabelShutdown=Выключение
BtnExecute=Выполнить
BtnCancelShutdown=Отменить выключение
LabelHour=ч
LabelMinute=м
LabelSecond=с
LabelVolume=Громкость
BtnApply=Применить
BtnMute=Без звука
LabelSystem=Система
BtnTaskManager=Диспетчер задач
LabelCmdLine=Команда
LabelRunCmd=Выполнить
BtnRun=Запустить
BtnClear=Очистить
BtnSend=Отправить
BtnStop=Остановить
BtnNewChat=Новый чат
BtnHistory=История
BtnStandalone=Отдельно
LabelLocateHint=Нажмите «Найти», затем укажите окно
GroupGenerate=Копирование
BtnGenerate=Сгенерировать
BtnLocateWindow=Найти
DropHint=Перетащите файлы сюда
CheckAutoStart=Автозапуск
CheckTopmost=Поверх всех
CheckAutoClicker=Автокликер
CheckPreventLock=Предотвращать блокировку
GroupRename=Переименование
BtnModify=Изменить
BtnDelete=Удалить
BtnCopyTo=Копировать в
BtnMoveTo=Переместить в
GroupCopyMove=Копировать / Переместить
GitDropHint=Перетащите папку или каталог с файлами сюда
LabelHourUnit=ч
LabelMinuteUnit=м
LabelSecondUnit=с
[Volume]
BtnApply=Применить
BtnMute=Без звука
Btn10Percent=10%
OpenTaskMgr=Диспетчер задач
[RunCmd]
BtnRun=Запустить
BtnClear=Очистить
InputPlaceholder=Введите команду...
[ToolLaunch]
PowerShell=PowerShell
WSL=WSL
GitHub=GitHub
[Filter]
RegexCheck=Регулярное выражение
RegexHelp=Справка
; ===== Menu translations =====
[Menu]
File=&Файл
Settings=&Настройки...
Exit=В&ыход
View=&Вид
ViewProcess=&Управление процессами
ViewStartup=&Автозагрузка
ViewClipboard=&Буфер обмена
ViewWindow=&Инструменты окон
ViewFile=&Управление файлами
ViewGit=&Git Toolbox
Open=&Открыть
OpenPowerShell=&PowerShell
OpenWSL=&WSL
OpenGitBash=&Git Bash
Window=&Окно
WindowLocate=&Найти окно
WindowUntopmost=&Убрать «поверх всех» со всех
MenuMinimizeToTray=Сворачивать в &трей
WindowClose=&Закрыть окно
Tools=&Инструменты
ToolsText=&Текстовые инструменты
ToolsMarkdown=&Предпросмотр Markdown
ToolsEncoding=&Конвертер кодировок
ToolsImage=&Графические инструменты
ToolsQRCode=&QR-код
ToolsScreenshotOCR=&OCR скриншотов
ToolsFile=&Файловые инструменты
ToolsBatchRename=&Пакетное переименование
ToolsSystem=&Системные инструменты
ToolsContextMenu=&Менеджер контекстного меню
ToolsEnvVar=&Переменные среды
ToolsFileLock=&Просмотр блокировок файлов
ToolsStickyNote=&Заметки
AddStartup=Добавить запись автозагрузки
DeleteStartup=Удалить запись автозагрузки
CopyPath=Копировать путь
CopyValue=Копировать значение
Untopmost=Убрать «поверх всех»
Topmost=Поверх всех
Delete=Удалить
Help=&Справка
HelpAbout=&О программе...
HelpShortcuts=&Горячие клавиши
HelpRegex=&Справка по регулярным выражениям
HelpGitHub=&GitHub
; ===== Dialog Captions =====
[DlgCaption]
AboutDlg=О PowerBox
MainDlg=PowerBox Toolbox
SettingsDlg=Настройки
ClickSpeedDlg=Скорость автокликера
QRCodeDlg=Генератор QR-кода
OCRDlg=OCR скриншотов
BatchRenameDlg=Пакетное переименование (перетащите папки сюда)
InputDlg=Ввод
AiRenameDlg=ИИ-помощник пакетного переименования
RegexGuideDlg=Справка по регулярным выражениям
StickyNoteDlg=Заметки
MarkdownDlg=Предпросмотр Markdown
EncodingDlg=Конвертер кодировок
ContextMenuDlg=Менеджер контекстного меню
EnvVarDlg=Переменные среды
EnvVarEditDlg=Переменная среды
EnvVarPathEditDlg=Изменение переменной PATH
FileLockDlg=Просмотр блокировок файлов
ProcessScanDlg=Результаты сканирования ИИ процессов
ProcessAiResultDlg=Результаты анализа ИИ процессов
GitCmdDlg=Команда Git
ConvHistoryDlg=История разговоров
AIAssistantDlg=ИИ-помощник
[AboutDlg]
Version=PowerBox, Версия 1.0
Copyright=Copyright (C) 2026
BtnOK=OK
[Shortcut]
ShortcutListTitle=Горячие клавиши
ShortcutList=Alt+1~6          - Переключение вкладок\nF5               - Обновить текущий список\n\nДополнительные функции см. в меню Вид/Инструменты/Окно.
BtnCopy=Копировать результат
BtnCount=Количество: %d/%d
ConfirmDeleteMultiple=Вы уверены, что хотите удалить %d выбранных элементов?
RClickDeleteSelected=Удалить выбранные (%d)
RClickUpSelected=Переместить выбранные вверх (%d)
RClickDownSelected=Переместить выбранные вниз (%d)
MaxItemsReached=Достигнут максимум (%d), больше добавить нельзя.
[RegexGuide]
GuideContent========== Справка по регулярным выражениям ==========\r\n\r\nЭтот инструмент использует C++ std::regex с синтаксисом ECMAScript по умолчанию (совместим с JavaScript regex).\r\n\r\n[Основной синтаксис]\r\n  .        Соответствует любому одному символу (кроме перевода строки)\r\n  \\d       Соответствует любой цифре [0-9]\r\n  \\D       Соответствует не цифре\r\n  \\w       Соответствует букве, цифре, подчёркиванию [a-zA-Z0-9_]\r\n  \\W       Соответствует не словесному символу\r\n  \\s       Соответствует пробельному символу (пробел, табуляция и т.п.)\r\n  \\S       Соответствует не пробельному символу\r\n  [abc]    Соответствует a, b или c\r\n  [^abc]   Соответствует любому символу, кроме a, b, c\r\n  [a-z]    Соответствует строчным буквам от a до z\r\n\r\n[Квантификаторы]\r\n  *        0 или более\r\n  +        1 или более\r\n  ?        0 или 1\r\n  {n}      Ровно n раз\r\n  {n,}     Не менее n раз\r\n  {n,m}    От n до m раз\r\n\r\n[Якоря]\r\n  ^        Начало строки\r\n  $        Конец строки\r\n  \\b       Граница слова\r\n\r\n[Группы и замена]\r\n  (pattern)      Захватывающая группа, ссылка в замене\r\n  (?:pattern)    Незахватывающая группа\r\n  $1, $2, ...    Ссылка на 1-ю, 2-ю захватывающую группу в замене\r\n  $&             Ссылка на всё совпадение в замене\r\n\r\n[Примеры]\r\n  Удалить все цифры:\r\n    Найти: \\d+    Заменить: (пусто)\r\n\r\n  Удалить начальный номер (например, «01_»):\r\n    Найти: ^\\d+_    Заменить: (пусто)\r\n\r\n  Заменить «IMG_001» на «Photo_001»:\r\n    Найти: ^IMG    Заменить: Photo\r\n\r\n  Поменять «имя_дата» на «дата_имя»:\r\n    Найти: ^(\\w+)_(\\w+)$    Заменить: $2_$1\r\n\r\n  Удалить скобки и содержимое:\r\n    Найти: \\(.*?\\)    Заменить: (пусто)\r\n\r\n  Удалить конечный номер «(1)», «(2)»:\r\n    Найти: \\(\\d+\\)$    Заменить: (пусто)\r\n\r\n  Заменить пробелы на подчёркивания:\r\n    Найти: \\s+    Заменить: _\r\n\r\n[Примечания]\r\n  - Замена применяется только к основе имени файла (без расширения)\r\n  - Расширение не изменяется\r\n  - Если регулярное выражение недействительно, правила замены игнорируются\r\n  - Специальные символы нужно экранировать: . * + ? ( ) [ ] { } \\ ^ $ |
[QuickLaunch]
DlgTitle=Управление элементами быстрого запуска
ColName=Имя
ColType=Тип
ColPath=Путь
BtnAdd=Добавить
BtnEdit=Изменить
BtnDelete=Удалить
BtnUp=Переместить вверх
BtnDown=Переместить вниз
BtnBrowse=Обзор
BtnCancel=Отмена
BtnOK=OK
AddTitle=Добавить элемент быстрого запуска
EditTitle=Изменить элемент быстрого запуска
NoSelection=Сначала выберите элемент
ConfirmDelete=Вы уверены, что хотите удалить «%s»?
ConfirmDeleteTitle=Подтверждение удаления
ItemNotFound=Не удаётся найти путь: %s
BtnManage=Управление
BrowseFolder=Выберите папку
TypeExecutable=Исполняемый файл
TypeFolder=Папка
TypeUrl=URL
TypeOtherFile=Другой файл
BtnChangeIcon=Изменить иконку
BtnResetIcon=Сбросить на значок по умолчанию
SelectIconFile=Выберите файл иконки
LabelName=Имя:
LabelType=Тип:
LabelPath=Путь:
LabelHotkey=Горячая клавиша пробуждения:
LabelIcon=Иконка:
BtnHotkey=Захватить
TypeHotkeyOnly=Только горячая клавиша
ColHotkey=Горячая клавиша
RClickAdd=Добавить
RClickEdit=Изменить
RClickDelete=Удалить
RClickUp=Переместить вверх
RClickDown=Переместить вниз
DropHintManage=Перетащите файлы или папки сюда для быстрого добавления
DropHintAdd=Перетащите файлы или папки сюда
BtnClose=Закрыть
LabelTruncate=Обрезка меток:
BtnCount=Количество: %d/%d
ConfirmDeleteMultiple=Вы уверены, что хотите удалить %d выбранных элементов?
RClickDeleteSelected=Удалить выбранные (%d)
RClickUpSelected=Переместить выбранные вверх (%d)
RClickDownSelected=Переместить выбранные вниз (%d)
MaxItemsReached=Достигнут максимум (%d), больше добавить нельзя.

[Hotkey]
CaptureTitle=Захват горячей клавиши
CapturePrompt=Нажмите комбинацию клавиш...
CaptureWaiting=Ожидание клавиши...
BtnClear=Очистить
KeySpace=Пробел
KeyEnter=Enter
None=Нет

[Terminal]
Title=Терминал
Shell=Shell
Clear=Очистить
Copy=Копировать
Paste=Вставить
Restart=Перезапустить терминал
Exited=[Процесс завершён]

New=Новый терминал
CloseTab=Закрыть вкладку
